base/DataProcessors/бит_ФормированиеОтраженийФактаДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ФормированиеОтраженийФактаДДС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроек</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражениеФактаДДССоздано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Comment>Организация</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Comment>Документ</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетБанкаПоОперациямЭквайринга</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Comment>Номер документа</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Comment>Дата документа</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Comment>Сумма документа</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Comment>Валюта документа</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтражениеФактаДДС</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_ОтражениеФактаДДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХозяйственнаяОперация</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

base/DataProcessors/бит_ФормированиеОтраженийФактаДДС/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодготовитьФормуНаСервере();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодДатаНачалаПриИзменении(Элемент)
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаОкончанияПриИзменении(Элемент)
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыНастроекПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если (ТекущаяСтраница = Элементы.СтраницаНастройкиКомпоновщикаОтбор
	  ИЛИ ТекущаяСтраница = Элементы.СтраницаНастройкиКомпоновщикаПорядок) И ИзмененыВыбранныеТипы Тогда
		Если ТипыДокументовЗаполненыПравильно() Тогда
			ОбработатьИзменениеВыбранныхТипов();
		Иначе	
			ТекущаяСтраница = Элементы.СтраницаТипыДокументов;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПереченьДокументов

&НаКлиенте
Процедура ПереченьДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле = Элементы.ПереченьДокументовВидДокумента
	 ИЛИ Поле = Элементы.ПереченьДокументовНомер 
	 ИЛИ Поле = Элементы.ПереченьДокументовДата Тогда
	 	ТекущиеДанные = Элементы.ПереченьДокументов.ТекущиеДанные;
	 		ПоказатьЗначение(, ТекущиеДанные.Документ);
			
	ИначеЕсли Поле = Элементы.ПереченьДокументовОтражениеФактаДДС Тогда
	 	ТекущиеДанные = Элементы.ПереченьДокументов.ТекущиеДанные;
	 		ПоказатьЗначение(, ТекущиеДанные.ОтражениеФактаДДС);
	Иначе	
		бит_РаботаСДиалогамиКлиент.ОбработкаВыбораПоляТабличногоПоля("ПереченьДокументов", 
			Объект.ПереченьДокументов, Поле, ВыбраннаяСтрока);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТипыДокументов

&НаКлиенте
Процедура ТипыДокументовПриИзменении(Элемент)
	
	ИзмененыВыбранныеТипы = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьНастройки(Команда)
	
	ПараметрыФормы = ПараметрыХраненияНастроек();
	Оповещение	   = Новый ОписаниеОповещения("ВыбратьНастройкиЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаЗагрузки", ПараметрыФормы, 
		ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
	
// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
// 
&НаКлиенте 
Процедура ВыбратьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда        
		ПрименитьНастройки(Результат);
		
		ИзмененыНастройки = Истина;
		ОбработатьИзменениеНастроек(ЭтотОбъект);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	Если НЕ ПериодЗаполненПравильно() ИЛИ НЕ ТипыДокументовЗаполненыПравильно() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = ПараметрыХраненияНастроек();
	ПараметрыФормы.Вставить("СтруктураНастройки" , СохраняемыеНастройки());
	
	Оповещение = Новый ОписаниеОповещения("СохранитьНастройкиЗавершение",ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаСохранения", ПараметрыФормы, 
		ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
											
КонецПроцедуры
	
// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
// 
&НаКлиенте
Процедура СохранитьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		УстановитьЗаголовок(Результат, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьНастройки(Команда)
	
	СкрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНастройки(Команда)
	
	ОткрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПериод(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Объект.Период;
	
	Оповещение = Новый ОписаниеОповещения("НастроитьПериодЗавершение",ЭтотОбъект);
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

// Обработчик завершения редактирования периода.
//  См. Синтакс-помощник: Показать().
// 
&НаКлиенте 
Процедура НастроитьПериодЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		Объект.Период = РезультатВыбора;
		ПриИзмененииПериода();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПереченьДокументов(Команда)
	
	Если НЕ ПериодЗаполненПравильно() ИЛИ НЕ ТипыДокументовЗаполненыПравильно() Тогда
		Возврат;
	КонецЕсли;
	
	СкрытьНастройки();

	НачатьЗаполнениеСпискаДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	ОбработатьФлагиПереченьДокументов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	ОбработатьФлагиПереченьДокументов(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	ОбъектыДляОбработки = Новый Массив;
	Для каждого СтрокаДокумента Из Объект.ПереченьДокументов Цикл
		Если СтрокаДокумента.Пометка Тогда
			ОбъектыДляОбработки.Добавить(СтрокаДокумента.Документ);
		КонецЕсли;
	КонецЦикла;

	Если НЕ ЗначениеЗаполнено(ОбъектыДляОбработки) Тогда
		ТекстСообщения = НСтр("ru = 'Выберите документы для обработки.'; en = 'Select the documents to process.'");
		ПоказатьПредупреждение(, ТекстСообщения);
	Иначе
		НачатьСозданиеДокументов();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФоновоеЗаполнение

&НаКлиенте
Процедура НачатьЗаполнениеСпискаДокументов()

	Если НЕ ПериодЗаполненПравильно() Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененыНастройки = Ложь;
	ОбработатьИзменениеНастроек(ЭтотОбъект);

	ДлительнаяОперация = ЗапуститьФоновоеЗаполнениеСпискаДокументов();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения 	   = НСтр("ru = 'Идет заполнение списка документов'"); 
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗаполненияСпискаДокументов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);

КонецПроцедуры

// Обработка оповещения. Подробности см.ДлительныеОперацииКлиент.ОжидатьЗавершение.
//
&НаКлиенте
Процедура ПослеЗаполненияСпискаДокументов(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Результат.Статус <> "Выполнено" Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении: %1'"); 
		ПоказатьПредупреждение(, СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	Иначе
		ПослеЗаполненияСпискаДокументовНаСервере(Результат.АдресРезультата)	
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ПослеЗаполненияСпискаДокументовНаСервере(АдресРезультата)

	РезультатПоиска    = Объект.ПереченьДокументов.НайтиСтроки(Новый Структура("Пометка", Истина));
	ВыбранныеДокументы = Новый Массив;
	Для каждого Элемент Из РезультатПоиска Цикл
		ВыбранныеДокументы.Добавить(Элемент.Документ);
	КонецЦикла;
	
	ТаблицаДокументов  = ПолучитьИзВременногоХранилища(АдресРезультата);
	Объект.ПереченьДокументов.Загрузить(ТаблицаДокументов);

	Если ЗначениеЗаполнено(ВыбранныеДокументы) Тогда
		Для каждого СтрокаТаблицы  Из Объект.ПереченьДокументов Цикл
			СтрокаТаблицы.Пометка = ВыбранныеДокументы.Найти(СтрокаТаблицы.Документ) <> Неопределено;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьФоновоеЗаполнениеСпискаДокументов()
		
	// Заполнение пераметов длительной операции.
	НаименованиеЗадания = НСтр("ru = 'Заполнение списка документов.'");
	ВыполняемыйМетод	= "Обработки.бит_ФормированиеОтраженийФактаДДС.ЗаполнитьПереченьДокументов";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	НастройкиКомпоновки 	   = Объект.КомпоновщикНастроек.ПолучитьНастройки(); 
	АдресСхемыКомпоновкиДанных = ИнициализироватьКомпоновщик(Объект.КомпоновщикНастроек);
	СКД 					   = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	
	НастройкиКомпоновкиДанных  = Объект.КомпоновщикНастроек.ПолучитьНастройки();
	
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "Период", Объект.Период);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "ОтражениеФактаДДССоздано", Объект.ОтражениеФактаДДССоздано);
	
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, 
						СКД, НастройкиКомпоновкиДанных);
						
	Возврат ФоновоеЗадание;

КонецФункции

#КонецОбласти

#Область ФоновоеСозданиеДокументов

&НаКлиенте
Процедура НачатьСозданиеДокументов()

	ОчиститьСообщения();

	ДлительнаяОперация = ЗапуститьФоновоеСозданиеДокументов();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения 	   = НСтр("ru = 'Идет обработка списка документов'; en = 'The list of documents is being processed'"); 
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСозданияДокументов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ЗапуститьФоновоеСозданиеДокументов()
	
	ВыполняемыйМетод	= "Обработки.бит_ФормированиеОтраженийФактаДДС.НовыеДокументыОтраженияФакта";
	НаименованиеЗадания = НСтр("ru = 'Формирование ""Отражение факта ДДС"".'; 
							|en = 'Generating ""Reflection of the fact DDS""'");

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	ВыбранныеДокументы = Объект.ПереченьДокументов.Выгрузить(Новый Структура("Пометка", Истина));
	
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, 
							ВыбранныеДокументы);
	Возврат ФоновоеЗадание;

КонецФункции

// Обработка оповещения. Подробности см.ДлительныеОперацииКлиент.ОжидатьЗавершение.
//
&НаКлиенте
Процедура ПослеСозданияДокументов(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ПослеСозданияДокументовНаСервере(Результат.АдресРезультата);
	Иначе
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении: %1'"); 
		ПоказатьПредупреждение(, СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ПослеСозданияДокументовНаСервере(АдресРезультата)

	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из Объект.ПереченьДокументов Цикл
		Если СтрокаТаблицы.Пометка Тогда
			ДобавленныйДокумент = Результат.Получить(СтрокаТаблицы.Документ);	
			Если ЗначениеЗаполнено(ДобавленныйДокумент) Тогда
				СтрокаТаблицы.Пометка	 		= Ложь;	
				СтрокаТаблицы.ОтражениеФактаДДС = ДобавленныйДокумент;		
			КонецЕсли;		
		КонецЕсли;
	КонецЦикла;
			
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПриИзмененииПериода()
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьИзменениеНастроек(Форма)

	Форма.Элементы.ДекорацияИзмененыНастройки.Видимость = Форма.ИзмененыНастройки;
	Форма.Элементы.ПереченьДокументов.Доступность    	= НЕ Форма.ИзмененыНастройки;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьНастройки()
	
	Если ТипыДокументовЗаполненыПравильно() Тогда
		Элементы.РазделыОбработки.ТекущаяСтраница = Элементы.СтраницаОбработка;
		Элементы.ОбновитьПереченьДокументов.КнопкаПоУмолчанию = Истина;
		
		Если ИзмененыНастройки Тогда
			ОбработатьИзменениеНастроек(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки()

	Элементы.РазделыОбработки.ТекущаяСтраница	  = Элементы.СтраницаНастройкиОбработки;
	Элементы.ПрименитьНастройки.КнопкаПоУмолчанию = Истина;	

КонецПроцедуры

&НаСервере
Функция СохраняемыеНастройки()
	
	СохраняемыеНастройки = Обработки.бит_ФормированиеОтраженийФактаДДС.НовыеСохраняемыеНастройки();
	
	НастройкаПериода = Объект.Период.Вариант;
	Если НастройкаПериода = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		НастройкаПериода = ВариантСтандартногоПериода.Сегодня;
	КонецЕсли;
	
	СохраняемыеНастройки.ВариантПериода 		   = НастройкаПериода; 
	СохраняемыеНастройки.НастройкиКомпоновкиДанных = Объект.КомпоновщикНастроек.ПолучитьНастройки();
	СохраняемыеНастройки.ВыбранныеТипы			   = Обработки.бит_ФормированиеОтраженийФактаДДС.ВыбранныеТипы(ТипыДокументов);
	
	Возврат СохраняемыеНастройки;
	
КонецФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	НастройкаПоУмолчанию = бит_ОтчетыСервер.НайтиНастройкуПоУмолчаниюДляОбъекта(НастраиваемыйОбъект());
	
	Обработки.бит_ФормированиеОтраженийФактаДДС.ЗаполнитьТипыДокументов(ТипыДокументов);
	
	ПрименитьНастройки(НастройкаПоУмолчанию);
	
	ОбработатьИзменениеНастроек(ЭтотОбъект);	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НастраиваемыйОбъект()

	Возврат "Обработка.бит_ФормированиеОтраженийФактаДДС";

КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл Проектное решение вызвать функционал другой подсистемы.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПереченьДокументовПометка");
	// АПК:277-вкл
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ПереченьДокументов.ОтражениеФактаДДС", ВидСравненияКомпоновкиДанных.Заполнено);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);	

КонецПроцедуры

&НаКлиенте
Функция ПериодЗаполненПравильно()

	ЗаполненПравильно = Истина;
	
	Отказ  = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Период.ДатаНачала) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Начало периода';en = 'Period start'")); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Период.ДатаНачала", "Объект", Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Период.ДатаОкончания) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Конец периода';en = 'Period end'")); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Период.ДатаОкончания", "Объект", Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Период.ДатаНачала) И ЗначениеЗаполнено(Объект.Период.ДатаОкончания) Тогда
		Если Объект.Период.ДатаОкончания < Объект.Период.ДатаНачала Тогда
			ТекстСообщения = НСтр("ru='Период указан неверно. Дата начала больше даты окончания.';
								  |en='The period is incorrect. The start date is greater than the end date.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Период.ДатаНачала", "Объект", Отказ);
		КонецЕсли;
	КонецЕсли; 
	
	Если Отказ Тогда
		ЗаполненПравильно = Ложь;
	КонецЕсли;  
	
	Возврат ЗаполненПравильно; 

КонецФункции

&НаКлиенте
Функция ТипыДокументовЗаполненыПравильно()

	ПометкаУстановлена = Ложь;
	
	Для каждого Элемент Из ТипыДокументов Цикл
		Если Элемент.Пометка Тогда
			ПометкаУстановлена = Истина;	
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Если НЕ ПометкаУстановлена Тогда
		ОткрытьНастройки();
		
		ТекстПояснения = НСтр("ru = 'Выберите типы документов.'; en = 'Select the document types.'");
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список" , "КОРРЕКТНОСТЬ",,,
							НСтр("ru = 'Типы документов'; en = 'Types of documents'"), ТекстПояснения);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ТипыДокументов");
	КонецЕсли;
	
	Возврат ПометкаУстановлена;
	
КонецФункции

&НаКлиенте
Функция ПараметрыХраненияНастроек()

	ПараметрыХранения = Новый Структура;
	ПараметрыХранения.Вставить("ТипНастройки",		  ПредопределенноеЗначение("Перечисление.бит_ТипыСохраненныхНастроек.Обработки"));
	ПараметрыХранения.Вставить("НастраиваемыйОбъект", НастраиваемыйОбъект());

	Возврат ПараметрыХранения;
	
КонецФункции

&НаСервере
Процедура ПрименитьНастройки(НастройкаПодбораДокументов)

	Обработки.бит_ФормированиеОтраженийФактаДДС.ПрименитьНастройки(НастройкаПодбораДокументов, 
		ТипыДокументов, Объект);									
	УстановитьЗаголовок(НастройкаПодбораДокументов, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовок(Настройка, Форма)

	Заголовок = НСтр("ru = 'Формирование отражений факта ДДС %1'; en = 'Creating a reflection of the fact DDS %1'");
	
	Если ЗначениеЗаполнено(Настройка) Тогда
		Заголовок = СтрШаблон(Заголовок, "(" + Строка(Настройка) + ")");
	Иначе	
		Заголовок = СтрШаблон(Заголовок, "");
	КонецЕсли;

	Форма.Заголовок = Заголовок;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФлагиПереченьДокументов(ЗначениеФлага)
		
	Для каждого ТекущаяСтрока Из Объект.ПереченьДокументов Цикл
		ИдентификаторСтроки = ТекущаяСтрока.ПолучитьИдентификатор();
		СтрокаСуществует 	= Элементы.ПереченьДокументов.ПроверитьСтроку(ИдентификаторСтроки); 
		Если СтрокаСуществует = Истина И НЕ ЗначениеЗаполнено(ТекущаяСтрока.ОтражениеФактаДДС) Тогда
			ТекущаяСтрока.Пометка = ЗначениеФлага;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеВыбранныхТипов()
	
	ИнициализироватьКомпоновщик(Объект.КомпоновщикНастроек);
	
	ИзмененыВыбранныеТипы = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ИнициализироватьКомпоновщик(КомпоновщикНастроек)

	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	
	ВыбранныеТипы = Обработки.бит_ФормированиеОтраженийФактаДДС.ВыбранныеТипы(ТипыДокументов);
	
	АдресСКД = Обработки.бит_ФормированиеОтраженийФактаДДС.ИнициализироватьКомпоновщик(КомпоновщикНастроек, 
						ВыбранныеТипы, НастройкиКомпоновкиДанных);
						
	Объект.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);					
	
	Возврат АдресСКД;
	     
КонецФункции

#КонецОбласти
